In [ ]:
#from sqlalchemy import create_engine
   #engine = create_engine('postgresql://localhost:5432/<Homework_db>')
   #connection = engine.connect()

In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
from scipy import stats
from scipy.stats import linregress
from pprint import pprint
import scipy.stats as st
from sqlalchemy import create_engine

In [4]:
#engine =  create_engine('postgres://ngocdiep@localhost/data_class/SQL_first_project/Data')
#engine = (f'postgresql://{postgres_username}:{postgres_pwd}@localhost:5432/<DBfilename>')

In [7]:
# read csv file
file_path = "Outputs/employees_salary.csv"
employees_data = pd.read_csv(file_path)
employees_data.head()

   emp_no first_name  last_name sex  salary
0   10005    Kyoichi   Maliniak   M   78228
1   10010  Duangkaew   Piveteau   F   72488
2   10011       Mary      Sluis   F   42365
3   10013  Eberhardt     Terkki   M   40000
4   10017  Cristinel  Bouloucos   F   71380

In [5]:
title_id_path = "Outputs/employees_decending_lastname.csv"
title_data = pd.read_csv(title_id_path)
title_data.head()

   emp_no title_id    birthday first_name last_name sex   hire_date
0   37248    e0002  1957-10-24     Rafail   dAstous   M  1995-04-08
1  102419    e0003  1960-10-19   Kamakshi   dAstous   M  1988-03-07
2   92014    e0003  1952-04-02  Keiichiro   dAstous   M  1991-05-13
3  483693    s0001  1954-09-19     Rasiah   dAstous   M  1998-12-05
4  421833    s0002  1959-11-27     Dmitry   dAstous   F  1990-01-31

In [8]:
# merge to have master_data
master_data = pd.merge(employees_data,title_data, on = "emp_no")
master_data.head()

,emp_no,first_name_x,last_name_x,sex_x,salary,title_id,birthday,first_name_y,last_name_y,sex_y,hire_date
0,10005,Kyoichi,Maliniak,M,78228,s0001,1955-01-21,Kyoichi,Maliniak,M,1989-09-12
1,10010,Duangkaew,Piveteau,F,72488,e0002,1963-06-01,Duangkaew,Piveteau,F,1989-08-24
2,10011,Mary,Sluis,F,42365,s0001,1953-11-07,Mary,Sluis,F,1990-01-22
3,10013,Eberhardt,Terkki,M,40000,s0002,1963-06-07,Eberhardt,Terkki,M,1985-10-20
4,10017,Cristinel,Bouloucos,F,71380,s0001,1958-07-06,Cristinel,Bouloucos,F,1993-08-03

In [10]:
title_path = "Data/titles.csv"
title_names = pd.read_csv(title_path)
title_names.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [12]:
# another merge to have data_vilualize
mergedf = pd.merge(master_data,title_names,on = "title_id")
mergedf.head()

,emp_no,first_name_x,last_name_x,sex_x,salary,title_id,birthday,first_name_y,last_name_y,sex_y,hire_date,title
0,10005,Kyoichi,Maliniak,M,78228,s0001,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,Staff
1,10011,Mary,Sluis,F,42365,s0001,1953-11-07,Mary,Sluis,F,1990-01-22,Staff
2,10017,Cristinel,Bouloucos,F,71380,s0001,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,Staff
3,10177,Pragnesh,Iisaka,M,48041,s0001,1954-11-08,Pragnesh,Iisaka,M,1993-02-06,Staff
4,10228,Karoline,Cesareni,F,79474,s0001,1953-04-21,Karoline,Cesareni,F,1991-08-26,Staff

In [14]:
#extract colums for visualization
extract_df = mergedf[["title","salary","emp_no"]]
extract_df

          title  salary  emp_no
0         Staff   78228   10005
1         Staff   42365   10011
2         Staff   71380   10017
3         Staff   48041   10177
4         Staff   79474   10228
...         ...     ...     ...
300019  Manager   40055  110765
300020  Manager   48077  111534
300021  Manager   40000  111939
300022  Manager   40000  111784
300023  Manager   53846  111877

[300024 rows x 3 columns]

In [24]:
# groupby to have salary per title
sal_title = extract_df.groupby(["title"]).mean()["salary"]
sal_title.head(8)

title
Assistant Engineer    48564.434447
Engineer              48535.336511
Manager               51531.041667
Senior Engineer       48506.799871
Senior Staff          58550.172704
Staff                 58465.382850
Technique Leader      48582.896092
Name: salary, dtype: float64

In [25]:
sal_titles = extract_df.groupby("title").agg({"salary":["mean"]})
sal_titles.head(8)

                          salary
                            mean
title
Assistant Engineer  48564.434447
Engineer            48535.336511
Manager             51531.041667
Senior Engineer     48506.799871
Senior Staff        58550.172704
Staff               58465.382850
Technique Leader    48582.896092

In [29]:
#most common salary range:
#common = sal_titles.loc[titles.duplicated(subset=['salary mean']),['title'].unique()

select salary, count (*)
as "common_sal"
from extract_df
group by salary
order by "common_sal" desc;

SyntaxError: invalid syntax (440871137.py, line 4)

In [ ]:
# visualize the most common salary ranges for employees by histogram
fig, axs = plt.subplots(1, 1,
                        figsize =(10, 7),
                        tight_layout = True)
 
axs.hist(x, bins = n_bins)

In [30]:
# visualize average salary by title by bar chart
titles = sal_titles["title"]
avg_sal = sal_titles["salary mean"]
plt.plot(titles,avg_sal, color = "blue")
plt.show()

KeyError: 'title'